Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 54, 54, 512)       186368    
_________________________________________________________________
batch_normalization (BatchNo (None, 54, 54, 512)       2048      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 27, 27, 512)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 23, 23, 256)       3277056   
_________________________________________________________________
batch_normalization_1 (Batch (None, 23, 23, 256)       1024      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 256)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 5, 5, 256)         590080    
_________________________________________________________________
batch_normalization_2 (Batch (None, 5, 5, 256)         1024      
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 5, 5, 256)         65792     
_________________________________________________________________
batch_normalization_3 (Batch (None, 5, 5, 256)         1024      
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 5, 5, 256)         65792     
_________________________________________________________________
batch_normalization_4 (Batch (None, 5, 5, 256)         1024      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 2, 2, 256)         0         
_________________________________________________________________
flatten (Flatten)            (None, 1024)              0         
_________________________________________________________________
dense (Dense)                (None, 2948)              3021700   
_________________________________________________________________
dropout (Dropout)            (None, 2948)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              3019776   
_________________________________________________________________
dropout_1 (Dropout)          (None, 1024)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 1024)              1049600   
_________________________________________________________________
dropout_2 (Dropout)          (None, 1024)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 2)                 2050      
=================================================================
Total params: 11,284,358
Trainable params: 11,281,286
Non-trainable params: 3,072
_________________________________________________________________
None
